zym787/stm32-platform-refactor/03_Firmware/01_APP/04_Impl/impl_bsp/Bsp_Drivers/st7789/driver/inc/bsp_st7789_reg.h
#ifndef __ST7789_DEFINE
#define __ST7789_DEFINE

/**
 *Color of pen
 *If you want to use another color, you can choose one in RGB565 format.
 */

#define WHITE                   0xFFFF
#define BLACK                   0x0000
#define BLUE                    0x001F
#define RED                     0xF800
#define MAGENTA                 0xF81F
#define GREEN                   0x07E0
#define CYAN                    0x7FFF
#define YELLOW                  0xFFE0
#define GRAY                    0X8430
#define BRED                    0XF81F
#define GRED                    0XFFE0
#define GBLUE                   0X07FF
#define BROWN                   0XBC40
#define BRRED                   0XFC07
#define DARKBLUE                0X01CF
#define LIGHTBLUE               0X7D7C
#define GRAYBLUE                0X5458

#define LIGHTGREEN              0X841F
#define LGRAY                   0XC618
#define LGRAYBLUE               0XA651
#define LBBLUE                  0X2B12

/* Control Registers and constant codes */
#define ST7789_NOP              0x00
#define ST7789_SWRESET          0x01
#define ST7789_RDDID            0x04
#define ST7789_RDDST            0x09

#define ST7789_SLPIN            0x10
#define ST7789_SLPOUT           0x11
#define ST7789_PTLON            0x12
#define ST7789_NORON            0x13

#define ST7789_INVOFF           0x20
#define ST7789_INVON            0x21
#define ST7789_DISPOFF          0x28
#define ST7789_DISPON           0x29
#define ST7789_CASET            0x2A
#define ST7789_RASET            0x2B
#define ST7789_RAMWR            0x2C
#define ST7789_RAMRD            0x2E

#define ST7789_PTLAR            0x30
#define ST7789_COLMOD           0x3A
#define ST7789_MADCTL           0x36

/**
 * Memory Data Access Control Register (0x36H)
 * MAP:     D7  D6  D5  D4  D3  D2  D1  D0
 * param:   MY  MX  MV  ML  RGB MH  -   -
 *
 */

/* Page Address Order ('0': Top to Bottom, '1': the opposite) */
#define ST7789_MADCTL_MY        0x80
/* Column Address Order ('0': Left to Right, '1': the opposite) */
#define ST7789_MADCTL_MX        0x40
/* Page/Column Order ('0' = Normal Mode, '1' = Reverse Mode) */
#define ST7789_MADCTL_MV        0x20 // 0x20
/* Line Address Order ('0' = LCD Refresh Top to Bottom, '1' = the opposite) */
#define ST7789_MADCTL_ML        0x10
/* RGB/BGR Order ('0' = RGB, '1' = BGR) */
#define ST7789_MADCTL_RGB       0x00

#define ST7789_RDID1            0xDA
#define ST7789_RDID2            0xDB
#define ST7789_RDID3            0xDC
#define ST7789_RDID4            0xDD

/* Tearing effect */
#define ST7789_TEOFF            0x34
#define ST7789_TEON             0x35

/* Panel / voltage configuration (used during init) */
#define ST7789_PORCTRL          0xB2 /* Porch control                         */
#define ST7789_GCTRL            0xB7 /* Gate control                          */
#define ST7789_VCOMS            0xBB /* VCOM setting                          */
#define ST7789_LCMCTRL          0xC0 /* LCM control                           */
#define ST7789_VDVVRHEN         0xC2 /* VDV / VRH command set enable          */
#define ST7789_VRHS             0xC3 /* VRH set                               */
#define ST7789_VDVS             0xC4 /* VDV set                               */
#define ST7789_FRCTRL2          0xC6 /* Frame rate control in normal mode     */
#define ST7789_PWCTRL1          0xD0 /* Power control 1                       */

/* Gamma correction */
#define ST7789_PVGAMCTRL        0xE0 /* Positive voltage gamma, 14 bytes      */
#define ST7789_NVGAMCTRL        0xE1 /* Negative voltage gamma, 14 bytes      */

/* Advanced options */
#define ST7789_COLOR_MODE_16bit 0x55 //  RGB565 (16bit)
#define ST7789_COLOR_MODE_18bit 0x66 //  RGB666 (18bit)


#endif                               /* __ST7789_DEFINE */
